src/Catalogs/оду_БазыУчастникиОбмена/оду_БазыУчастникиОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>оду_БазыУчастникиОбмена</name>
  <comment>Узлы обмена с базами аян</comment>
  <attributes>
    <name>Используется</name>
    <comment>Вкл / выкл участника обмена</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяБД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоРабочаяБД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоддержкуРавныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>555</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРегистрации</name>
    <type>
      <types>CatalogRef.оду_ПравилаРегистрацииОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКонвертацииОбмена</name>
    <type>
      <types>CatalogRef.оду_НастройкаКонвертацииДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентВыгрузкиДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентЗагрузкиДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМеханизмОтложенногоПроведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКаталогаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодчиненныйУчастникОбмена</name>
    <comment>Все входящие данные передает в подчиненные</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспределятьПодчиненнымУО</name>
    <comment>Распределять данные обмена по подчиненным учатникам обмена</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланОбмена</name>
    <type>
      <types>ExchangePlanRef.оду_ПланОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборыОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипXMLОбъектаИсточника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипXMLОбъектаПриемника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регистрировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьСамолет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоРегистрации</name>
      <type>
        <types>CatalogRef.оду_ПравилаРегистрацииОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаКонвертацииОбмена</name>
      <type>
        <types>CatalogRef.оду_НастройкаКонвертацииДанных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипXMLОбъектаИсточника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДОбъектаИсточника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипXMLОбъектаПриемника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДОбъектаПриемника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтрольОстатков</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипXMLОбъектаИсточника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипXMLОбъектаПриемника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контролировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизвольныеЗапросы</name>
    <attributes>
      <name>Запрос</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РежимОбмена</name>
      <type>
        <types>EnumRef.оду_РежимОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяВводДопНастроекПередВыгрузкой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимОтладки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКОбработке</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоРегистрации</name>
      <type>
        <types>CatalogRef.оду_ПравилаРегистрацииОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <comment>Вкл / выкл участника обмена</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаКонвертацииОбмена</name>
      <type>
        <types>CatalogRef.оду_НастройкаКонвертацииДанных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/оду_БазыУчастникиОбмена/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)    
	
	МассивОтборов = Новый Массив;
				  
	Для каждого Стр Из Организации Цикл
	
		ЗаполнитьОтборыПриИзменении(Стр, ТекущаяБД);
		СтруктураОтборов = Новый Структура("ТипXMLОбъектаИсточника, ИДОбъектаИсточника, ТипXMLОбъектаПриемника, ИДОбъектаПриемника"); 
		ЗаполнитьЗначенияСвойств(СтруктураОтборов, Стр);
		МассивОтборов.Добавить(СтруктураОтборов);
		
	КонецЦикла;
	
	Если МассивОтборов.Количество() > 0 Тогда
		ОтборыОбмена = ЗначениеВСтрокуВнутр(МассивОтборов);
	Иначе
		ОтборыОбмена = "";
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьОтборыПриИзменении(ТекЭлемент, ЭтоТекущаяБД)  Экспорт
	 
	Если ЗначениеЗаполнено(ТекЭлемент.Организация)  Тогда
		
		Если ЭтоТекущаяБД = Истина Тогда
			
			ТекЭлемент.ИДОбъектаИсточника = пр_Общий.ИД_Ссылки(ТекЭлемент.Организация);
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ИДОбъектаПриемника) Тогда
				ТекЭлемент.ИДОбъектаПриемника = ТекЭлемент.ИДОбъектаИсточника;  //По умолчанию они равны
			КонецЕсли; 

			ТипXML = пр_Общий.ИмяТипаXMLПоСсылке(ТекЭлемент.Организация);
			ТекЭлемент.ТипXMLОбъектаИсточника = ТипXML; 
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ТипXMLОбъектаПриемника) Тогда
				ТекЭлемент.ТипXMLОбъектаПриемника = ТипXML;  //По умолчанию они равны
			КонецЕсли;    
			
		Иначе 
			
			ТекЭлемент.ИДОбъектаПриемника = пр_Общий.ИД_Ссылки(ТекЭлемент.Организация);
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ИДОбъектаИсточника) Тогда
				ТекЭлемент.ИДОбъектаИсточника = ТекЭлемент.ИДОбъектаПриемника;  //По умолчанию они равны
			КонецЕсли;    
			
			ТипXML = пр_Общий.ИмяТипаXMLПоСсылке(ТекЭлемент.Организация);
			ТекЭлемент.ТипXMLОбъектаПриемника = ТипXML;
			Если НЕ ЗначениеЗаполнено(ТекЭлемент.ТипXMLОбъектаИсточника) Тогда
				ТекЭлемент.ТипXMLОбъектаИсточника = ТипXML;  //По умолчанию они равны
			КонецЕсли;    
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
